OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
/*
 * Copyright (c) 2013-2020 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifdef _RTE_
    #include "RTE_Components.h"
#endif
/* Project can define PRJ_RTE_DEVICE_HEADER macro to include private or global RTE_Device.h. */
#ifdef   PRJ_RTE_DEVICE_HEADER
    #include PRJ_RTE_DEVICE_HEADER
#else
    #include "RTE_Device/RTE_Device.h"
#endif

#include "Driver_USBD.h"
#include <string.h>
#include "NuMicro.h"

// Configuration depending on RTE_Device_USBD.h
// Check if at least one peripheral instance is configured in RTE_Device_USBD.h
#if (RTE_USBD1 == 1)
// *****************************************************************************
// Compile-time configuration (that can be externally overridden if necessary)

// Maximum number of endpoints
#ifndef USBD_MAX_ENDPOINT_NUM
    #define USBD_MAX_ENDPOINT_NUM           (HSUSBD_MAX_EP)
#endif

// Maximum packet size for Endpoint 0
#ifndef USBD_EP0_MAX_PACKET_SIZE
    #define USBD_EP0_MAX_PACKET_SIZE        (64)
#endif

// Maximum RAM for endpoint buffers
#ifndef USBD_BUF_SIZE
    #define USBD_BUF_SIZE                   (8192)
#endif

#ifndef _USBD_USE_DMA
    #define _USBD_USE_DMA                   (1)
#endif
// *****************************************************************************

// Macros
#define ARM_USBD_DRV_VERSION    ARM_DRIVER_VERSION_MAJOR_MINOR(1, 0) /* driver version */
// Macro for porting compatibility
#define USBD_t          HSUSBD_T
#define USBD_EP_t       HSUSBD_EP_T
// Macro for section for RW info
#ifdef  USBD_SECTION_NAME
    #define USBDn_SECTION_(name,n)  __attribute__((section(name #n)))
    #define USBDn_SECTION(n)        USBDn_SECTION_(USBD_SECTION_NAME,n)
#else
    #define USBDn_SECTION(n)
#endif

// Macro for declaring functions (for instances)
#define FUNCS_DECLARE(n)                                                                                                   \
    static  ARM_USBD_CAPABILITIES   USBD##n##_GetCapabilities           (void);                                            \
    static  int32_t                 USBD##n##_Initialize                (ARM_USBD_SignalDeviceEvent_t   cb_device_event,   \
                                                                         ARM_USBD_SignalEndpointEvent_t cb_endpoint_event);\
    static  int32_t                 USBD##n##_Uninitialize              (void);                                            \
    static  int32_t                 USBD##n##_PowerControl              (ARM_POWER_STATE state);                           \
    static  int32_t                 USBD##n##_DeviceConnect             (void);                                            \
    static  int32_t                 USBD##n##_DeviceDisconnect          (void);                                            \
    static  ARM_USBD_STATE          USBD##n##_DeviceGetState            (void);                                            \
    static  int32_t                 USBD##n##_DeviceRemoteWakeup        (void);                                            \
    static  int32_t                 USBD##n##_DeviceSetAddress          (uint8_t  dev_addr);                               \
    static  int32_t                 USBD##n##_ReadSetupPacket           (uint8_t *setup);                                  \
    static  int32_t                 USBD##n##_EndpointConfigure         (uint8_t  ep_addr,                                 \
                                                                         uint8_t  ep_type,                                 \
                                                                         uint16_t ep_max_packet_size);                     \
    static  int32_t                 USBD##n##_EndpointUnconfigure       (uint8_t  ep_addr);                                \
    static  int32_t                 USBD##n##_EndpointStall             (uint8_t  ep_addr, bool stall);                    \
    static  int32_t                 USBD##n##_EndpointTransfer          (uint8_t  ep_addr,                                 \
                                                                         uint8_t *data,                                    \
                                                                         uint32_t num);                                    \
    static  uint32_t                USBD##n##_EndpointTransferGetResult (uint8_t  ep_addr);                                \
    static  int32_t                 USBD##n##_EndpointTransferAbort     (uint8_t  ep_addr);                                \
    static  uint16_t                USBD##n##_GetFrameNumber            (void);

// Macro for defining functions (for instances)
#define FUNCS_DEFINE(n)                                                                                                                                                                                                        \
    static  ARM_USBD_CAPABILITIES   USBD##n##_GetCapabilities           (void)                                             { return USBDn_GetCapabilities           (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_Initialize                (ARM_USBD_SignalDeviceEvent_t   cb_device_event,                                                                                                       \
                                                                         ARM_USBD_SignalEndpointEvent_t cb_endpoint_event) { return USBDn_Initialize                (&usbd##n##_info, cb_device_event, cb_endpoint_event); }   \
    static  int32_t                 USBD##n##_Uninitialize              (void)                                             { return USBDn_Uninitialize              (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_PowerControl              (ARM_POWER_STATE state)                            { return USBDn_PowerControl              (&usbd##n##_info, state); }                                \
    static  int32_t                 USBD##n##_DeviceConnect             (void)                                             { return USBDn_DeviceConnect             (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_DeviceDisconnect          (void)                                             { return USBDn_DeviceDisconnect          (&usbd##n##_info); }                                       \
    static  ARM_USBD_STATE          USBD##n##_DeviceGetState            (void)                                             { return USBDn_DeviceGetState            (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_DeviceRemoteWakeup        (void)                                             { return USBDn_DeviceRemoteWakeup        (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_DeviceSetAddress          (uint8_t  dev_addr)                                { return USBDn_DeviceSetAddress          (&usbd##n##_info, dev_addr); }                             \
    static  int32_t                 USBD##n##_ReadSetupPacket           (uint8_t *setup)                                   { return USBDn_ReadSetupPacket           (&usbd##n##_info, setup); }                                \
    static  int32_t                 USBD##n##_EndpointConfigure         (uint8_t  ep_addr,                                                                                                                                     \
                                                                         uint8_t  ep_type,                                                                                                                                     \
                                                                         uint16_t ep_max_packet_size)                      { return USBDn_EndpointConfigure         (&usbd##n##_info, ep_addr, ep_type, ep_max_packet_size); } \
    static  int32_t                 USBD##n##_EndpointUnconfigure       (uint8_t  ep_addr)                                 { return USBDn_EndpointUnconfigure       (&usbd##n##_info, ep_addr); }                              \
    static  int32_t                 USBD##n##_EndpointStall             (uint8_t  ep_addr, bool stall)                     { return USBDn_EndpointStall             (&usbd##n##_info, ep_addr, stall); }                       \
    static  int32_t                 USBD##n##_EndpointTransfer          (uint8_t  ep_addr,                                                                                                                                     \
                                                                         uint8_t *data,                                                                                                                                        \
                                                                         uint32_t num)                                     { return USBDn_EndpointTransfer          (&usbd##n##_info, ep_addr, data, num); }                   \
    static  uint32_t                USBD##n##_EndpointTransferGetResult (uint8_t  ep_addr)                                 { return USBDn_EndpointTransferGetResult (&usbd##n##_info, ep_addr); }                              \
    static  int32_t                 USBD##n##_EndpointTransferAbort     (uint8_t  ep_addr)                                 { return USBDn_EndpointTransferAbort     (&usbd##n##_info, ep_addr); }                              \
    static  uint16_t                USBD##n##_GetFrameNumber            (void)                                             { return USBDn_GetFrameNumber            (&usbd##n##_info); }
// Macro for defining driver structures (for instances)
#define USBD_DRIVER(n)                  \
    ARM_DRIVER_USBD Driver_USBD##n = {    \
                                          USBD_GetVersion,                      \
                                          USBD##n##_GetCapabilities,            \
                                          USBD##n##_Initialize,                 \
                                          USBD##n##_Uninitialize,               \
                                          USBD##n##_PowerControl,               \
                                          USBD##n##_DeviceConnect,              \
                                          USBD##n##_DeviceDisconnect,           \
                                          USBD##n##_DeviceGetState,             \
                                          USBD##n##_DeviceRemoteWakeup,         \
                                          USBD##n##_DeviceSetAddress,           \
                                          USBD##n##_ReadSetupPacket,            \
                                          USBD##n##_EndpointConfigure,          \
                                          USBD##n##_EndpointUnconfigure,        \
                                          USBD##n##_EndpointStall,              \
                                          USBD##n##_EndpointTransfer,           \
                                          USBD##n##_EndpointTransferGetResult,  \
                                          USBD##n##_EndpointTransferAbort,      \
                                          USBD##n##_GetFrameNumber              \
                                     };

// Endpoint related macros
#define EP_OUT_INDEX            (0U)
#define EP_IN_INDEX             (1U)
#define EP_DIR(ep_addr)         (((ep_addr) >> 7) & 1U)
#define EP_NUM(ep_addr)         (ep_addr & ARM_USB_ENDPOINT_NUMBER_MASK)

