OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
typedef enum
{
    PERIPH_EPA = 0,
    PERIPH_EPB = 1,
    PERIPH_EPC = 2,
    PERIPH_EPD = 3,
    PERIPH_EPE = 4,
    PERIPH_EPF = 5,
    PERIPH_EPG = 6,
    PERIPH_EPH = 7,
    PERIPH_EPI = 8,
    PERIPH_EPJ = 9,
    PERIPH_EPK = 10,
    PERIPH_EPL = 11,
    PERIPH_EPM = 12,
    PERIPH_EPN = 13,
    PERIPH_EPO = 14,
    PERIPH_EPP = 15,
    PERIPH_EPQ = 16,
    PERIPH_EPR = 17,
    PERIPH_EPS = 18,
    PERIPH_EPT = 19,
    PERIPH_EPU = 20,
    PERIPH_EPV = 21,
    PERIPH_EPW = 22,
    PERIPH_EPX = 23,
    PERIPH_EPY = 24,
    PERIPH_EPZ = 25,
    PERIPH_MAX_EP = USBD_MAX_ENDPOINT_NUM,
} EP_Num_t;

static const uint8_t epcfg_eptype_table[] =
{
    [ARM_USB_ENDPOINT_ISOCHRONOUS] = 3 << HSUSBD_EPCFG_EPTYPE_Pos,
                                       [ARM_USB_ENDPOINT_BULK]        = 1 << HSUSBD_EPCFG_EPTYPE_Pos,
                                       [ARM_USB_ENDPOINT_INTERRUPT]   = 2 << HSUSBD_EPCFG_EPTYPE_Pos,
};

static const uint8_t eprspctl_eptype_table[] =
{
    [ARM_USB_ENDPOINT_ISOCHRONOUS] = 2 << HSUSBD_EPRSPCTL_MODE_Pos, /* Fly Mode */
                                       [ARM_USB_ENDPOINT_BULK]        = 0 << HSUSBD_EPRSPCTL_MODE_Pos, /* Auto-Validate Mode */
                                       [ARM_USB_ENDPOINT_INTERRUPT]   = 1 << HSUSBD_EPRSPCTL_MODE_Pos, /* Manual-Validate Mode */
};
// Centralized location for USBD interrupt enable bit masks
static const uint32_t enabled_irqs = HSUSBD_GINTEN_USBIEN_Msk | HSUSBD_GINTEN_CEPIEN_Msk | \
                                     HSUSBD_GINTEN_EPAIEN_Msk | HSUSBD_GINTEN_EPBIEN_Msk | HSUSBD_GINTEN_EPCIEN_Msk | HSUSBD_GINTEN_EPDIEN_Msk | HSUSBD_GINTEN_EPEIEN_Msk | HSUSBD_GINTEN_EPFIEN_Msk | \
                                     HSUSBD_GINTEN_EPGIEN_Msk | HSUSBD_GINTEN_EPHIEN_Msk | HSUSBD_GINTEN_EPIIEN_Msk | HSUSBD_GINTEN_EPJIEN_Msk | HSUSBD_GINTEN_EPKIEN_Msk | HSUSBD_GINTEN_EPLIEN_Msk | \
                                     HSUSBD_GINTEN_EPMIEN_Msk | HSUSBD_GINTEN_EPNIEN_Msk | HSUSBD_GINTEN_EPOIEN_Msk | HSUSBD_GINTEN_EPPIEN_Msk | HSUSBD_GINTEN_EPQIEN_Msk | HSUSBD_GINTEN_EPRIEN_Msk;

// Driver status
typedef struct
{
    uint8_t                       initialized  : 1;       // Initialized status: 0 - not initialized, 1 - initialized
    uint8_t                       powered      : 1;       // Power status:       0 - not powered,     1 - powered
    uint8_t                       reserved     : 6;       // Reserved (for padding)
} DriverStatus_t;

// USB Device state
typedef struct
{
    volatile uint8_t              vbus;                   // USB Device VBUS state
    volatile uint8_t              speed;                  // USB Device speed (ARM_USB_SPEED_xxx) state
    volatile uint8_t              active;                 // USB Device active state
} USBD_State_t;

// Endpoint information
typedef struct
{
    uint8_t *volatile             data;                   // Pointer to data
    volatile uint32_t             num;                    // Number of bytes to transfer
    volatile uint16_t             configured;             // Endpoint configuration status
    uint16_t                      max_packet_size;        // Maximum packet size (in bytes)
    volatile uint32_t             num_transferred_total;  // Number of totally transferred bytes
    uint8_t                       ep_addr;                // Endpoint address
    volatile uint8_t              short_packet;           // Set on short packet detection
    volatile uint8_t              dma_request;            // DMA transfer pending flag for this endpoint
    uint8_t                       reserved[1];            // Reserved (for padding)
} EP_Info_t;

// DMA information
typedef struct
{
    volatile EP_Info_t           *current_ep;             // Current endpoint being served by DMA (NULL when idle)
} DMA_Info_t;

// Instance run-time information (RW)
typedef struct
{
    ARM_USBD_SignalDeviceEvent_t  cb_device_event;        // Device event callback
    ARM_USBD_SignalEndpointEvent_t cb_endpoint_event;     // Endpoint event callback
    DriverStatus_t                drv_status;             // Driver status
    USBD_State_t                  usbd_state;             // USB Device state
    uint32_t                      bufseg_addr;            // Allocated USB RAM
    volatile int32_t              cep_event;              // Control endpoint event
    volatile uint32_t             setup_received;         // Setup Packet received flag (0 - not received or read already, 1 - received and unread yet)
    volatile uint8_t              setup_packet[8];        // Setup Packet data
    EP_Info_t                     ep_info[PERIPH_MAX_EP]; // Endpoint information
    EP_Info_t                     cep_info[2];            // Control Endpoint information (0 - out, 1 - in)
    DMA_Info_t                    dma_info;               // DMA controller state
} RW_Info_t;

// Instance compile-time information (RO)
// also contains pointer to run-time information
typedef struct
{
    USBD_t                       *ptr_USBD;               // Pointer to USBD handle
    int32_t                       irq_n;
} RO_Info_t;

typedef struct
{
    const RO_Info_t              *ptr_ro_info;            // Pointer to compile-time information (RO)
    RW_Info_t                    *ptr_rw_info;            // Pointer to run-time information (RW)
} USBD_Info_t;


// Local functions prototypes
static const USBD_Info_t        *USBD_GetInfo(const USBD_t *husbd);
static ARM_DRIVER_VERSION       USBD_GetVersion(void);
static ARM_USBD_CAPABILITIES    USBDn_GetCapabilities(const USBD_Info_t *const ptr_usbd_info);
static int32_t                  USBDn_Initialize(const USBD_Info_t *const ptr_usbd_info, ARM_USBD_SignalDeviceEvent_t cb_device_event, ARM_USBD_SignalEndpointEvent_t cb_endpoint_event);
static int32_t                  USBDn_Uninitialize(const USBD_Info_t *const ptr_usbd_info);
static int32_t                  USBDn_PowerControl(const USBD_Info_t *const ptr_usbd_info, ARM_POWER_STATE state);
static int32_t                  USBDn_DeviceConnect(const USBD_Info_t *const ptr_usbd_info);
static int32_t                  USBDn_DeviceDisconnect(const USBD_Info_t *const ptr_usbd_info);
static ARM_USBD_STATE           USBDn_DeviceGetState(const USBD_Info_t *const ptr_usbd_info);
static int32_t                  USBDn_DeviceRemoteWakeup(const USBD_Info_t *const ptr_usbd_info);
static int32_t                  USBDn_DeviceSetAddress(const USBD_Info_t *const ptr_usbd_info, uint8_t  dev_addr);
static int32_t                  USBDn_ReadSetupPacket(const USBD_Info_t *const ptr_usbd_info, uint8_t *setup);
static int32_t                  USBDn_EndpointConfigure(const USBD_Info_t *const ptr_usbd_info, uint8_t  ep_addr, uint8_t  ep_type, uint16_t ep_max_packet_size);
static int32_t                  USBDn_EndpointUnconfigure(const USBD_Info_t *const ptr_usbd_info, uint8_t  ep_addr);
static int32_t                  USBDn_EndpointStall(const USBD_Info_t *const ptr_usbd_info, uint8_t  ep_addr, bool stall);
static int32_t                  USBDn_EndpointTransfer(const USBD_Info_t *const ptr_usbd_info, uint8_t  ep_addr, uint8_t *data, uint32_t num);
static uint32_t                 USBDn_EndpointTransferGetResult(const USBD_Info_t *const ptr_usbd_info, uint8_t  ep_addr);
static int32_t                  USBDn_EndpointTransferAbort(const USBD_Info_t *const ptr_usbd_info, uint8_t  ep_addr);
static uint16_t                 USBDn_GetFrameNumber(const USBD_Info_t *const ptr_usbd_info);

#if(RTE_USBD1)
static const RO_Info_t usbd1_ro_info = {HSUSBD, HSUSBD_IRQn};
static        RW_Info_t         usbd1_rw_info USBDn_SECTION(1);
static  const USBD_Info_t       usbd1_info = { &usbd1_ro_info,
                                               &usbd1_rw_info                                                                                                 \
                                             };
FUNCS_DECLARE(1)
FUNCS_DEFINE(1)
USBD_DRIVER(1)
#endif

// List of available USBD instance infos
static const USBD_Info_t *const usbd_info_list[] =
{
#if (RTE_USBD1)
    &usbd1_info,
#endif
    NULL
};

