OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
/* Driver Version */
static const ARM_DRIVER_VERSION usbd_driver_version =
{
    ARM_USBD_API_VERSION,
    ARM_USBD_DRV_VERSION
};

// Auxiliary functions

/**
  \fn          USBD_Info_t *USBD_GetInfo (const USBD_t *husbd)
  \brief       Get pointer to USBD_GetInfo structure corresponding to specified husbd.
  \param[in]   husbd    Pointer to USBD handle structure (USBD_t)
  \return      pointer to USBD info structure (USBD_Info_t)
*/
static const USBD_Info_t *USBD_GetInfo(const USBD_t *husbd)
{
    const USBD_Info_t *ptr_usbd_info;
    uint8_t i;

    ptr_usbd_info = NULL;

    // Find USBD which uses same husbd handle as parameter ptr_USBD
    for (i = 0U; i < (sizeof(usbd_info_list) / sizeof(USBD_t *)); i++)
    {
        if (usbd_info_list[i] != NULL)
        {
            if (usbd_info_list[i]->ptr_ro_info->ptr_USBD == husbd)
            {
                ptr_usbd_info = usbd_info_list[i];
                break;
            }
        }
    }

    return ptr_usbd_info;
}

/**
  \fn          USBD_EP_t *USBD_EndpointEntry(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr, bool add)
  \brief       Find or allocate a peripheral endpoint entry.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   add  Operation
                - \b false Find peripheral endpoint that matches ep_addr
                - \b true Open peripheral endpoint
  \return      Pointer to USBD EP handle structure (USBD_EP_t)
*/

static USBD_EP_t *USBD_EndpointEntry(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr, bool add)
{
    EP_Num_t ep_index;
    EP_Info_t *ptr_ep;
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;
    USBD_EP_t *ep;

    for (ep_index = PERIPH_EPA, ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[PERIPH_EPA], ep = husbd->EP;
            ep_index < PERIPH_MAX_EP;
            ep_index++, ptr_ep++, ep++)
    {
        if (add)
        {
            if (0 == (ep->EPCFG & HSUSBD_EPCFG_EPEN_Msk)) return ep;
        }
        else
        {
            if (ptr_ep->ep_addr == ep_addr) return ep;
        }
    }

    return NULL;
}

/**
  \fn          USBD_WriteEpBuffer(uint32_t u32EpDat[], uint8_t u8Src[], uint32_t num)
  \brief       Write data into the USB endpoint buffer (IN transaction).
  \details     This function writes data from a source buffer into the USB endpoint data (DAT) buffer.
  \param[out]  u32EpDat   Pointer to the endpoint DAT register (Endpoint Data Buffer).
  \param[in]   u8Src      Pointer to the source data buffer in system memory.
  \param[in]   num        Number of bytes to read from the endpoint buffer.
*/
void USBD_WriteEpBuffer(uint32_t u32EpDat[], uint8_t u8Src[], uint32_t num)
{
    uint32_t i = 0;

    /* align src to 4-byte boundary */
    for (; ((uint32_t)(uintptr_t)u8Src & 3u) && (i < num); i++)
    {
        outpb(u32EpDat, *u8Src++);
    }

    /* word write */
    {
        uint32_t *pu32Src = (uint32_t *)u8Src;
        uint32_t u32Words = (num - i) / 4u;
        uint32_t j;

        for (j = 0; j < u32Words; j++)
        {
            outpw(u32EpDat, pu32Src[j]);
        }

        i      += u32Words * 4u;
        u8Src  += u32Words * 4u;
    }

    /* tail */
    for (; i < num; i++)
    {
        outpb(u32EpDat, *u8Src++);
    }
}

/**
  \fn          USBD_ReadEpBuffer(uint8_t u8Dst[], uint32_t u32EpDat[], uint32_t num)
  \brief       Read data from the USB endpoint buffer (OUT transaction).
  \details     This function reads data from a USB endpoint data buffer (DAT) into a destination buffer.
  \param[out]  u8Dst      Pointer to the destination buffer in system memory.
  \param[in]   u32EpDat   Pointer to the endpoint DAT register (Endpoint Data Buffer).
  \param[in]   num        Number of bytes to read from the endpoint buffer.
*/

void USBD_ReadEpBuffer(uint8_t u8Dst[], uint32_t u32EpDat[], uint32_t num)
{
    uint32_t i = 0;

    /* align dst to 4-byte boundary */
    for (; ((uint32_t)(uintptr_t)u8Dst & 3u) && (i < num); i++)
    {
        *u8Dst++ = inpb(u32EpDat);
    }

    /* word read */
    {
        uint32_t *pu32Dst = (uint32_t *)u8Dst;
        uint32_t u32Words = (num - i) / 4u;
        uint32_t j;

        for (j = 0; j < u32Words; j++)
        {
            pu32Dst[j] = inpw(u32EpDat);
        }

        i      += u32Words * 4u;
        u8Dst  += u32Words * 4u;
    }

    /* tail */
    for (; i < num; i++)
    {
        *u8Dst++ = inpb(u32EpDat);
    }
}

/**
  \fn          void USBD_EndpointConfigureBuffer (const USBD_Info_t *const ptr_usbd_info)
  \brief       Configure and reassign USB endpoint buffer addresses in USB SRAM.
  \details     This function resets the buffer allocation pointer and reconfigures the buffer segmentation for all enabled endpoints.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
*/
static void USBD_EndpointConfigureBuffer(const USBD_Info_t *const ptr_usbd_info)
{
    // USB RAM beyond what we've allocated above is available to the user (Control endpoint used).
    ptr_usbd_info->ptr_rw_info->bufseg_addr = USBD_EP0_MAX_PACKET_SIZE;

    // Reconfigure the buffer segmentation for all enabled endpoints.
    EP_Num_t ep_index;
    USBD_EP_t *ep;

    for (ep_index = PERIPH_EPA, ep = &ptr_usbd_info->ptr_ro_info->ptr_USBD->EP[PERIPH_EPA]; ep_index < PERIPH_MAX_EP; ep_index++, ep++)
    {
        if (0 == (ep->EPCFG & HSUSBD_EPCFG_EPEN_Msk)) continue;

        // Update the endpoint buffer segmentation
        ep->EPBUFSTART = ptr_usbd_info->ptr_rw_info->bufseg_addr;
        ep->EPBUFEND = ptr_usbd_info->ptr_rw_info->bufseg_addr + ptr_usbd_info->ptr_rw_info->ep_info[ep_index].max_packet_size - 1U;
        ptr_usbd_info->ptr_rw_info->bufseg_addr += ptr_usbd_info->ptr_rw_info->ep_info[ep_index].max_packet_size;
        // Set endpoint payload
        ep->EPMPS = ptr_usbd_info->ptr_rw_info->ep_info[ep_index].max_packet_size;
    }
}

// Driver functions ************************************************************

/**
  \fn          ARM_DRIVER_VERSION USBD_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBD_GetVersion(void)
{
    return usbd_driver_version;
}

/**
  \fn          ARM_USBD_CAPABILITIES USBDn_GetCapabilities (const USBD_Info_t * const ptr_usbd_info)
  \brief       Get driver capabilities.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref ARM_USBD_CAPABILITIES
*/
static ARM_USBD_CAPABILITIES USBDn_GetCapabilities(const USBD_Info_t *const ptr_usbd_info)
{
    ARM_USBD_CAPABILITIES driver_capabilities;

    (void)ptr_usbd_info;
    // Clear capabilities structure
    memset(&driver_capabilities, 0, sizeof(ARM_USBD_CAPABILITIES));

