OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
    // If VBUS detection is available
    driver_capabilities.vbus_detection = 1U;
    driver_capabilities.event_vbus_on  = 1U;
    driver_capabilities.event_vbus_off = 1U;

    return driver_capabilities;
}

/**
  \fn          int32_t USBDn_Initialize (const USBD_Info_t * const      ptr_usbd_info,
                                         ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                         ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
  \brief       Initialize USB Device Interface.
  \param[in]   ptr_usbd_info      Pointer to USBD info structure (USBD_Info_t)
  \param[in]   cb_device_event    Pointer to \ref ARM_USBD_SignalDeviceEvent
  \param[in]   cb_endpoint_event  Pointer to \ref ARM_USBD_SignalEndpointEvent
  \return      \ref execution_status
*/
static int32_t USBDn_Initialize(const USBD_Info_t *const ptr_usbd_info, ARM_USBD_SignalDeviceEvent_t cb_device_event,
                                ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
{
    // Clear run-time info
    memset((void *)ptr_usbd_info->ptr_rw_info, 0, sizeof(RW_Info_t));

    // Register callback functions
    ptr_usbd_info->ptr_rw_info->cb_device_event   = cb_device_event;
    ptr_usbd_info->ptr_rw_info->cb_endpoint_event = cb_endpoint_event;
    // Set driver status to initialized
    ptr_usbd_info->ptr_rw_info->drv_status.initialized = 1U;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_Uninitialize (const USBD_Info_t * const ptr_usbd_info)
  \brief       De-initialize USB Device Interface.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref execution_status
*/
static int32_t USBDn_Uninitialize(const USBD_Info_t *const ptr_usbd_info)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered != 0U)
    {
        // If peripheral is powered, power off the peripheral
        (void)USBDn_PowerControl(ptr_usbd_info, ARM_POWER_OFF);
    }

    // Clear run-time info
    memset((void *)ptr_usbd_info->ptr_rw_info, 0, sizeof(RW_Info_t));

    return ARM_DRIVER_OK;
}

static int32_t USBDn_PowerControl(const USBD_Info_t *const ptr_usbd_info, ARM_POWER_STATE state)
{
    ARM_USBD_SignalDeviceEvent_t   cb_device_event;
    ARM_USBD_SignalEndpointEvent_t cb_endpoint_event;
    DriverStatus_t                 drv_status;
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;

    switch (state)
    {
        case ARM_POWER_FULL:
            if (ptr_usbd_info->ptr_rw_info->drv_status.initialized == 0U)
            {
                return ARM_DRIVER_ERROR;
            }

            // Store variables we need to preserve
            cb_device_event   = ptr_usbd_info->ptr_rw_info->cb_device_event;
            cb_endpoint_event = ptr_usbd_info->ptr_rw_info->cb_endpoint_event;
            drv_status        = ptr_usbd_info->ptr_rw_info->drv_status;

            // Clear run-time info
            memset((void *)ptr_usbd_info->ptr_rw_info, 0, sizeof(RW_Info_t));

            // Restore variables we wanted to preserve
            ptr_usbd_info->ptr_rw_info->cb_device_event   = cb_device_event;
            ptr_usbd_info->ptr_rw_info->cb_endpoint_event = cb_endpoint_event;
            ptr_usbd_info->ptr_rw_info->drv_status        = drv_status;

            // Set driver status to powered
            ptr_usbd_info->ptr_rw_info->drv_status.powered = 1U;

            uint32_t u32TimeOutCnt = SystemCoreClock;
            // Initialize USB engine
            husbd->PHYCTL |= HSUSBD_PHYCTL_PHYEN_Msk;

            // Wait PHY clock ready
            while (!(husbd->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
            {
                if (--u32TimeOutCnt == 0) return ARM_DRIVER_ERROR_TIMEOUT;
            }

            NVIC_EnableIRQ(ptr_usbd_info->ptr_ro_info->irq_n);

            // Enable USB BUS, CEP and EPA-R global interrupt
            husbd->GINTEN = enabled_irqs;
            // Enable BUS interrupt
            husbd->BUSINTEN = HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk;
            // USB High-speed initiate a chirp-sequence
            husbd->OPER = HSUSBD_OPER_HISPDEN_Msk;

            break;

        case ARM_POWER_OFF:

            for (EP_Num_t ep_index = PERIPH_EPA; ep_index < PERIPH_MAX_EP; ep_index++)
            {
                husbd->EP[ep_index].EPCFG = 0;
            }

            NVIC_DisableIRQ(ptr_usbd_info->ptr_ro_info->irq_n);

            // Set driver status to not powered
            ptr_usbd_info->ptr_rw_info->drv_status.powered = 0U;

            // Store variables we need to preserve
            cb_device_event   = ptr_usbd_info->ptr_rw_info->cb_device_event;
            cb_endpoint_event = ptr_usbd_info->ptr_rw_info->cb_endpoint_event;
            drv_status        = ptr_usbd_info->ptr_rw_info->drv_status;

            // Clear run-time info
            memset((void *)ptr_usbd_info->ptr_rw_info, 0, sizeof(RW_Info_t));

            // Restore variables we wanted to preserve
            ptr_usbd_info->ptr_rw_info->cb_device_event   = cb_device_event;
            ptr_usbd_info->ptr_rw_info->cb_endpoint_event = cb_endpoint_event;
            ptr_usbd_info->ptr_rw_info->drv_status        = drv_status;
            break;

        case ARM_POWER_LOW:
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_DeviceConnect (const USBD_Info_t * const ptr_usbd_info)
  \brief       Connect USB Device.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref execution_status
*/
static int32_t USBDn_DeviceConnect(const USBD_Info_t *const ptr_usbd_info)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    // Pull D+ high to let the host detect a Full-Speed device and complete the connection.
    ptr_usbd_info->ptr_ro_info->ptr_USBD->PHYCTL |= HSUSBD_PHYCTL_DPPUEN_Msk;

    if (ptr_usbd_info->ptr_ro_info->ptr_USBD->OPER & HSUSBD_OPER_HISPDEN_Msk)
        ptr_usbd_info->ptr_ro_info->ptr_USBD->OPER |= HSUSBD_OPER_HISHSEN_Msk;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_DeviceDisconnect (const USBD_Info_t * const ptr_usbd_info)
  \brief       Disconnect USB Device.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref execution_status
*/
static int32_t USBDn_DeviceDisconnect(const USBD_Info_t *const ptr_usbd_info)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    // To simulate a disconnection, the pull-up is disabled to create a Single-Ended Zero (SE0) condition.
    ptr_usbd_info->ptr_ro_info->ptr_USBD->PHYCTL &= ~HSUSBD_PHYCTL_DPPUEN_Msk;
    return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USBD_STATE USBDn_DeviceGetState (const USBD_Info_t * const ptr_usbd_info)
  \brief       Get current USB Device State.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      Device State \ref ARM_USBD_STATE
*/
static ARM_USBD_STATE USBDn_DeviceGetState(const USBD_Info_t *const ptr_usbd_info)
{
    ARM_USBD_STATE state;
    // Clear state structure
    memset(&state, 0, sizeof(ARM_USBD_STATE));

    // Process additionally handled communication information
    if (ptr_usbd_info->ptr_rw_info->usbd_state.vbus != 0U)
    {
        state.vbus = 1U;
    }

    switch (ptr_usbd_info->ptr_rw_info->usbd_state.speed)
    {
        case ARM_USB_SPEED_FULL:
            state.speed = ARM_USB_SPEED_FULL;
            break;

        case ARM_USB_SPEED_HIGH:
            state.speed = ARM_USB_SPEED_HIGH;
            break;

        default:
            break;
    }

