OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
    if (ptr_usbd_info->ptr_rw_info->usbd_state.active != 0U)
    {
        state.active = 1U;
    }

    return state;
}

/**
  \fn          int32_t USBDn_DeviceRemoteWakeup (const USBD_Info_t * const ptr_usbd_info)
  \brief       Trigger USB Remote Wakeup.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref execution_status
*/
static int32_t USBDn_DeviceRemoteWakeup(const USBD_Info_t *const ptr_usbd_info)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    ptr_usbd_info->ptr_ro_info->ptr_USBD->OPER |= HSUSBD_OPER_RESUMEEN_Msk;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_DeviceSetAddress (const USBD_Info_t * const ptr_usbd_info, uint8_t dev_addr)
  \brief       Set USB Device Address.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   dev_addr  Device Address
  \return      \ref execution_status
*/
static int32_t USBDn_DeviceSetAddress(const USBD_Info_t *const ptr_usbd_info, uint8_t dev_addr)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    ptr_usbd_info->ptr_ro_info->ptr_USBD->FADDR = dev_addr;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_ReadSetupPacket (const USBD_Info_t * const ptr_usbd_info, uint8_t *setup)
  \brief       Read setup packet received over Control Endpoint.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[out]  setup  Pointer to buffer for setup packet
  \return      \ref execution_status
*/
static int32_t USBDn_ReadSetupPacket(const USBD_Info_t *const ptr_usbd_info, uint8_t *setup)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (ptr_usbd_info->ptr_rw_info->setup_received == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    do
    {
        ptr_usbd_info->ptr_rw_info->setup_received = 0U;
        memcpy((uint8_t *)setup, (uint8_t *)ptr_usbd_info->ptr_rw_info->setup_packet, 8U);
    } while (ptr_usbd_info->ptr_rw_info->setup_received != 0U);

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_EndpointConfigure (const USBD_Info_t * const ptr_usbd_info,
                                                      uint8_t           ep_addr,
                                                      uint8_t           ep_type,
                                                      uint16_t          ep_max_packet_size)
  \brief       Configure USB Endpoint.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   ep_type  Endpoint Type (ARM_USB_ENDPOINT_xxx)
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \return      \ref execution_status
*/
static int32_t USBDn_EndpointConfigure(const USBD_Info_t *const ptr_usbd_info, uint8_t  ep_addr,
                                       uint8_t  ep_type,
                                       uint16_t ep_max_packet_size)
{
    EP_Info_t *ptr_ep;
    uint32_t   ep_dir_mask, ep_type_mask;
    uint8_t    ep_num = EP_NUM(ep_addr);
    uint8_t    ep_dir = EP_DIR(ep_addr);

    // Unconfigure Endpoint
    USBDn_EndpointUnconfigure(ptr_usbd_info, ep_addr);

    if (ep_num != 0)
    {
        USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, true);

        // Error if all periph endpoints used
        if (ep == NULL)
        {
            return ARM_DRIVER_ERROR_PARAMETER;
        }

        ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[ep - ptr_usbd_info->ptr_ro_info->ptr_USBD->EP];

        // Error if USB buffer is insufficient
        if (ptr_usbd_info->ptr_rw_info->bufseg_addr + ep_max_packet_size > USBD_BUF_SIZE)
        {
            return ARM_DRIVER_ERROR;
        }

        ep->EPRSPCTL = (HSUSBD_EP_RSPCTL_FLUSH | eprspctl_eptype_table[ep_type]);

        // Configured endpoint
        ep_dir_mask = ep_dir ? HSUSBD_EP_CFG_DIR_IN : HSUSBD_EP_CFG_DIR_OUT;
        ep_type_mask = epcfg_eptype_table[ep_type];

        ep->EPCFG = ((ep_num << HSUSBD_EPCFG_EPNUM_Pos) | ep_dir_mask | ep_type_mask | HSUSBD_EPCFG_EPEN_Msk);
    }
    else
    {
        ptr_ep = &ptr_usbd_info->ptr_rw_info->cep_info[ep_dir];
    }

    // Store ep address information
    ptr_ep->ep_addr = ep_addr;

    // Store max packet size information
    ptr_ep->max_packet_size = ep_max_packet_size;

    // Reconfigure the buffer segmentation for all enabled endpoints (must configure EP before configuring buffer segmentation)
    USBD_EndpointConfigureBuffer(ptr_usbd_info);

    // Update endpoint configured status
    ptr_ep->configured = 1U;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_EndpointUnconfigure (const USBD_Info_t * const ptr_usbd_info, uint8_t ep_addr)
  \brief       Unconfigure USB Endpoint.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBDn_EndpointUnconfigure(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
{
    EP_Info_t *ptr_ep;

    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (EP_NUM(ep_addr) != 0)
    {
        USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);

        if (ep != NULL)
        {
            ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[ep - ptr_usbd_info->ptr_ro_info->ptr_USBD->EP];
            // Clear Endpoint information
            memset((void *)ptr_ep, 0, sizeof(EP_Info_t));
            ptr_ep->data = NULL;
            ptr_ep->num = 0U;

            // Clear Endpoint configuration
            ep->EPCFG = 0;
            ep->EPRSPCTL = HSUSBD_EP_RSPCTL_TOGGLE;
        }
    }
    else
    {
        ptr_ep = &ptr_usbd_info->ptr_rw_info->cep_info[EP_DIR(ep_addr)];
        // Clear Endpoint information
        memset((void *)ptr_ep, 0, sizeof(EP_Info_t));
        ptr_ep->data = NULL;
        ptr_ep->num = 0U;
    }

    // Deallocate USB RAM and update bufseg_addr
    USBD_EndpointConfigureBuffer(ptr_usbd_info);

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_EndpointStall (const USBD_Info_t * const ptr_usbd_info, uint8_t ep_addr, bool stall)
  \brief       Set/Clear Stall for USB Endpoint.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   stall  Operation
                - \b false Clear
                - \b true Set
  \return      \ref execution_status
*/
static int32_t USBDn_EndpointStall(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr, bool stall)
{

    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (stall)
    {
        // Set STALL
        if (EP_NUM(ep_addr) != 0)
        {
            USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
            ep->EPRSPCTL = (ep->EPRSPCTL & 0xf7) | HSUSBD_EPRSPCTL_HALT_Msk;
        }
        else
        {
            ptr_usbd_info->ptr_ro_info->ptr_USBD->CEPCTL = HSUSBD_CEPCTL_STALLEN_Msk;
        }
    }
    else
    {
        if (EP_NUM(ep_addr) != 0)
        {
            // Clear STALL
            USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
            ep->EPRSPCTL = HSUSBD_EPRSPCTL_TOGGLE_Msk;
        }
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_EndpointTransfer (const USBD_Info_t * const ptr_usbd_info, uint8_t ep_addr, uint8_t *data, uint32_t num)
  \brief       Read data from or Write data to USB Endpoint.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[out]  data Pointer to buffer for data to read or with data to write
  \param[in]   num  Number of data bytes to transfer
  \return      \ref execution_status
*/
static int32_t USBDn_EndpointTransfer(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr, uint8_t *data, uint32_t num)
{
    EP_Info_t *ptr_ep;
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;
    USBD_EP_t *ep = NULL;
    uint8_t    ep_num = EP_NUM(ep_addr);

    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (ep_num != 0)
    {
        ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
        uint8_t  periph_epnum = ep - husbd->EP;
        ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[periph_epnum];
    }
    else
    {
        ptr_ep = &ptr_usbd_info->ptr_rw_info->cep_info[EP_DIR(ep_addr)];
    }

    // Clear number of transferred bytes
    ptr_ep->num_transferred_total = 0U;

    // Register pointer to data and number of bytes to transfer for Endpoint
    ptr_ep->data = data;
    ptr_ep->num = num;

