OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
    // Prepare to transfer
    if (EP_DIR(ep_addr))    // IN
    {
        if (EP_NUM(ep_addr) != 0)
        {
#if (_USBD_USE_DMA==1 && NVT_DCACHE_ON == 1)
            // Clean cache to SRAM
            SCB_CleanDCache_by_Addr((uint8_t *)ptr_ep->data, DCACHE_ALIGN_LINE_SIZE(ptr_ep->num));
#endif
            ep->EPINTEN = HSUSBD_EPINTEN_BUFEMPTYIEN_Msk;
        }
        else
        {
            if (ptr_ep->num)
            {
                husbd->CEPCTL = HSUSBD_CEPCTL_FLUSH_Msk;
                husbd->CEPINTSTS = HSUSBD_CEPINTSTS_INTKIF_Msk;
                husbd->CEPINTEN = HSUSBD_CEPINTEN_INTKIEN_Msk;
            }
            else    // Zero Length Packet
            {
                ptr_usbd_info->ptr_rw_info->cep_event |= ARM_USBD_EVENT_IN;
                husbd->CEPINTSTS = HSUSBD_CEPINTSTS_STSDONEIF_Msk;
                husbd->CEPCTL = HSUSBD_CEPCTL_NAKCLR;
                husbd->CEPINTEN = HSUSBD_CEPINTEN_STSDONEIEN_Msk;
            }
        }
    }
    else    // OUT
    {
        if (EP_NUM(ep_addr) != 0)
        {
            ep->EPINTEN = HSUSBD_EPINTEN_RXPKIEN_Msk;
        }
        else
        {
            if (ptr_ep->num)
            {
                uint32_t u32TimeOutCnt = SystemCoreClock >> 2;

                while (ptr_ep->num < (husbd->CEPRXCNT & HSUSBD_CEPRXCNT_RXCNT_Msk))
                    if (--u32TimeOutCnt == 0) break;

                USBD_ReadEpBuffer(ptr_ep->data, (uint32_t *)&husbd->CEPDAT, ptr_ep->num);
                ptr_ep->num_transferred_total += ptr_ep->num;
            }

            if ((ptr_ep->num_transferred_total < ptr_ep->max_packet_size) || (ptr_ep->num_transferred_total == ptr_ep->num))
            {
                ptr_usbd_info->ptr_rw_info->cb_endpoint_event(0x00U, ARM_USBD_EVENT_OUT);
            }
        }
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t USBDn_EndpointTransferGetResult (const USBD_Info_t * const ptr_usbd_info, uint8_t ep_addr)
  \brief       Get result of USB Endpoint transfer.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      number of successfully transferred data bytes
*/
static uint32_t USBDn_EndpointTransferGetResult(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return 0U;
    }

    EP_Info_t *ptr_ep;

    if (EP_NUM(ep_addr) != 0)
    {
        USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
        uint8_t   periph_epnum = ep - ptr_usbd_info->ptr_ro_info->ptr_USBD->EP;
        ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[periph_epnum];

        if (periph_epnum >= PERIPH_MAX_EP)
        {
            return 0U;
        }
    }
    else
    {
        ptr_ep = &ptr_usbd_info->ptr_rw_info->cep_info[EP_DIR(ep_addr)];
    }

    return ptr_ep->num_transferred_total;
}

static int32_t USBDn_EndpointTransferAbort(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
{
    // Reset DMA
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACNT = 0U;
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACTL = HSUSBD_DMACTL_DMARST_Msk;
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACTL = 0U;

    if (EP_NUM(ep_addr) != 0U)
    {
        USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
        ep->EPRSPCTL |= HSUSBD_EPRSPCTL_FLUSH_Msk;
    }
    else
    {
        ptr_usbd_info->ptr_ro_info->ptr_USBD->CEPCTL |= HSUSBD_CEPCTL_FLUSH_Msk;
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          uint16_t USBDn_GetFrameNumber (const USBD_Info_t * const ptr_usbd_info)
  \brief       Get current USB Frame Number.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      Frame Number
*/
static uint16_t USBDn_GetFrameNumber(const USBD_Info_t *const ptr_usbd_info)
{
    return ((ptr_usbd_info->ptr_ro_info->ptr_USBD->FRAMECNT & HSUSBD_FRAMECNT_FRAMECNT_Msk) >> HSUSBD_FRAMECNT_FRAMECNT_Pos);
}

// Event functions *****************************************************************
/**
  \fn          void USBD_DataStage_DMA (const USBD_Info_t *const ptr_usbd_info)
  \brief       Handle data stage for DMA transfer.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
*/
__attribute__((unused)) static void USBD_DataStage_DMA(const USBD_Info_t *const ptr_usbd_info)
{
    EP_Num_t ep_index;
    EP_Info_t *ptr_ep;
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;
    USBD_EP_t *ep;

    DMA_Info_t *ptr_dma = &ptr_usbd_info->ptr_rw_info->dma_info;

    // While DMA is busy, do not start another transfer
    if (ptr_dma->current_ep) return;

    for (ep_index = PERIPH_EPA, ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[PERIPH_EPA], ep = husbd->EP;
            ep_index < PERIPH_MAX_EP; ep_index++, ptr_ep++, ep++)
    {
        uint32_t num_to_transfer;
        uint32_t dmactl;
        uint8_t  ep_dir;

        if (!ptr_ep->dma_request) continue;

        ep_dir = EP_DIR(ptr_ep->ep_addr);

        husbd->BUSINTEN = (HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_DMADONEIEN_Msk);

        if (ep_dir)
        {
            if (ptr_ep->num_transferred_total == ptr_ep->num) continue;

            num_to_transfer = ptr_ep->num - ptr_ep->num_transferred_total;

            if (num_to_transfer > ptr_ep->max_packet_size)
            {
                num_to_transfer = ptr_ep->max_packet_size;
            }

            dmactl = (husbd->DMACTL & ~HSUSBD_DMACTL_EPNUM_Msk) | HSUSBD_DMACTL_DMARD_Msk | EP_NUM(ptr_ep->ep_addr) | HSUSBD_DMACTL_SVINEP_Msk;
        }
        else
        {
            num_to_transfer = ep->EPDATCNT & HSUSBD_EPDATCNT_DATCNT_Msk;

            if (!num_to_transfer) continue;

            dmactl = (husbd->DMACTL & ~(HSUSBD_DMACTL_EPNUM_Msk | HSUSBD_DMACTL_DMARD_Msk | HSUSBD_DMACTL_SVINEP_Msk)) | EP_NUM(ptr_ep->ep_addr);
        }

        if (num_to_transfer < ptr_ep->max_packet_size)
        {
            ptr_ep->short_packet = true;
        }

        // Program and start the DMA transfer (common to IN and OUT)
        husbd->DMACTL = dmactl;
        husbd->DMAADDR = (uint32_t)ptr_ep->data + ptr_ep->num_transferred_total;
        husbd->DMACNT = num_to_transfer;
        husbd->BUSINTSTS = HSUSBD_BUSINTSTS_DMADONEIF_Msk;
        ptr_ep->num_transferred_total += num_to_transfer;
        ptr_dma->current_ep = ptr_ep;

        // For IN transfers, arm the TX-packet interrupt when the last packet is queued
        if (ep_dir && (ptr_ep->num_transferred_total == ptr_ep->num))
        {
            ep->EPINTSTS = HSUSBD_EPINTSTS_TXPKIF_Msk;
            ep->EPINTEN = HSUSBD_EPINTEN_TXPKIEN_Msk;
        }

