OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
        husbd->DMACTL |= HSUSBD_DMACTL_DMAEN_Msk;

        return;
    }
}

/**
  \fn          void USBD_DataStage_PIO(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
  \brief       Handle data stage for CPU transfer.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
*/
__attribute__((unused)) static void USBD_DataStage_PIO(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
{
    EP_Info_t *ptr_ep;
    uint32_t   num_to_transfer;
    uint8_t   *data;
    USBD_EP_t *ep;

    ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
    ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[ep - ptr_usbd_info->ptr_ro_info->ptr_USBD->EP];

    data = ptr_ep->data + ptr_ep->num_transferred_total;

    if (EP_DIR(ep_addr))
    {
        // If there is more data to transfer
        num_to_transfer = ptr_ep->num - ptr_ep->num_transferred_total;

        if (num_to_transfer > ptr_ep->max_packet_size)
        {
            num_to_transfer = ptr_ep->max_packet_size;
        }

        // Update transferred number
        ptr_ep->num_transferred_total += num_to_transfer;

        if (ptr_ep->num_transferred_total == ptr_ep->num)
        {
            ep->EPINTSTS = HSUSBD_EPINTSTS_TXPKIF_Msk;
            ep->EPINTEN = HSUSBD_EPINTEN_TXPKIEN_Msk;
        }

        USBD_WriteEpBuffer((uint32_t *)&ep->EPDAT, data, num_to_transfer);

        if (num_to_transfer != ptr_ep->max_packet_size) ep->EPRSPCTL = HSUSBD_EPRSPCTL_SHORTTXEN_Msk;
    }
    else
    {
        num_to_transfer = ep->EPDATCNT & HSUSBD_EPDATCNT_DATCNT_Msk;

        USBD_ReadEpBuffer(data, (uint32_t *)&ep->EPDAT, num_to_transfer);

        // Update transferred number
        ptr_ep->num_transferred_total += num_to_transfer;

        if ((ptr_ep->num_transferred_total >= ptr_ep->num) || (num_to_transfer < ptr_ep->max_packet_size))
        {
            ep->EPINTEN = 0;

            if (ptr_usbd_info->ptr_rw_info->cb_endpoint_event != NULL)
            {
                ptr_usbd_info->ptr_rw_info->cb_endpoint_event(ep_addr, ARM_USBD_EVENT_OUT);
            }
        }
    }
}

/**
  \fn          void USBD_SetupStage(const USBD_Info_t *const ptr_usbd_info)
  \brief       Setup stage.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
*/
static void USBD_SetupStage(const USBD_Info_t *const ptr_usbd_info)
{
    ptr_usbd_info->ptr_rw_info->setup_packet[0] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP1_0 >> 0) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[1] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP1_0 >> 8) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[2] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP3_2 >> 0) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[3] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP3_2 >> 8) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[4] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP5_4 >> 0) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[5] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP5_4 >> 8) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[6] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP7_6 >> 0) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[7] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP7_6 >> 8) & 0xFF);

    ptr_usbd_info->ptr_rw_info->setup_received = 1U;

    if (ptr_usbd_info->ptr_rw_info->cb_endpoint_event != NULL)
    {
        ptr_usbd_info->ptr_rw_info->cb_endpoint_event(0x00U, ARM_USBD_EVENT_SETUP);
    }
}

/**
  \fn          void USBD_BusReset (const USBD_Info_t *const ptr_usbd_info)
  \brief       USBD Bus Reset.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
*/
static void USBD_BusReset(const USBD_Info_t *const ptr_usbd_info)
{
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;
    // Clear Endpoints information
    memset((void *)ptr_usbd_info->ptr_rw_info->ep_info, 0U, PERIPH_MAX_EP * sizeof(EP_Info_t));
    memset((void *)ptr_usbd_info->ptr_rw_info->cep_info, 0U, 2 * sizeof(EP_Info_t));

    // Reset USBD state information
    ptr_usbd_info->ptr_rw_info->usbd_state.speed  = ARM_USB_SPEED_FULL;
    ptr_usbd_info->ptr_rw_info->usbd_state.active = 0U;

    if (ptr_usbd_info->ptr_rw_info->cb_device_event != NULL)
    {
        ptr_usbd_info->ptr_rw_info->cb_device_event(ARM_USBD_EVENT_RESET);
    }

    // Reset DMA
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACNT = 0U;
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACTL = HSUSBD_DMACTL_DMARST_Msk;
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACTL = 0U;

    for (EP_Num_t ep_index = PERIPH_EPA; ep_index < PERIPH_MAX_EP; ep_index++)
    {
        ptr_usbd_info->ptr_ro_info->ptr_USBD->EP[ep_index].EPCFG = 0U;
    }

    // Buffer for control endpoint
    husbd->CEPBUFSTART = 0U;
    husbd->CEPBUFEND = USBD_EP0_MAX_PACKET_SIZE - 1U;

    // Configure Endpoint 0 OUT
    (void)USBDn_EndpointConfigure(ptr_usbd_info, 0x00U, ARM_USB_ENDPOINT_CONTROL, USBD_EP0_MAX_PACKET_SIZE);

    // Configure Endpoint 0 IN
    (void)USBDn_EndpointConfigure(ptr_usbd_info, 0x80U, ARM_USB_ENDPOINT_CONTROL, USBD_EP0_MAX_PACKET_SIZE);

    ptr_usbd_info->ptr_ro_info->ptr_USBD->FADDR = 0U;
    // After reset we consider USB as active
    ptr_usbd_info->ptr_rw_info->usbd_state.active = 1U;
}

// IRQ handler *********************************************************************

NVT_ITCM void HSUSBDn_IRQHandler(const USBD_Info_t *const ptr_usbd_info)
{
    volatile uint32_t u32IntSts, u32BusSts, u32EpIntSts;
    uint32_t u32TimeOutCnt;
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;
    EP_Info_t *ptr_ep;
    uint32_t event = 0;

    u32IntSts = husbd->GINTSTS & husbd->GINTEN;

    if (!u32IntSts)    return;

    //------------------------------------------------------------------
    if (u32IntSts & HSUSBD_GINTSTS_USBIF_Msk)
    {
        // Bus event
        u32BusSts = husbd->BUSINTSTS & husbd->BUSINTEN;

