OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
        if (u32BusSts & HSUSBD_BUSINTSTS_SOFIF_Msk)
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_SOFIF_Msk;

        if (u32BusSts & HSUSBD_BUSINTSTS_RSTIF_Msk)
        {
            USBD_BusReset(ptr_usbd_info);

            ptr_usbd_info->ptr_rw_info->usbd_state.speed = (husbd->OPER & HSUSBD_OPER_CURSPD_Msk) ? ARM_USB_SPEED_HIGH : ARM_USB_SPEED_FULL;

            if (ptr_usbd_info->ptr_rw_info->usbd_state.speed == ARM_USB_SPEED_HIGH)
                event |= ARM_USBD_EVENT_HIGH_SPEED;

            husbd->CEPINTEN = HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk;
            husbd->BUSINTEN = (HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_RSTIF_Msk;
            husbd->CEPINTSTS = 0x1ffc;
        }

        if (u32BusSts & HSUSBD_BUSINTSTS_RESUMEIF_Msk)
        {
            husbd->PHYCTL |= (HSUSBD_PHYCTL_PHYEN_Msk | HSUSBD_PHYCTL_DPPUEN_Msk);
            u32TimeOutCnt = SystemCoreClock; // 1 second time-out

            while (!(ptr_usbd_info->ptr_ro_info->ptr_USBD->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
                if (--u32TimeOutCnt == 0) break;

            husbd->BUSINTEN = (HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_RESUMEIF_Msk;
            event |= ARM_USBD_EVENT_RESUME;

        }

        if (u32BusSts & HSUSBD_BUSINTSTS_SUSPENDIF_Msk)
        {
            husbd->BUSINTEN = (HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_SUSPENDIF_Msk;
            event |= ARM_USBD_EVENT_SUSPEND;
        }

        if (u32BusSts & HSUSBD_BUSINTSTS_HISPDIF_Msk)
        {
            husbd->CEPINTEN = HSUSBD_CEPINTEN_SETUPPKIEN_Msk;
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_HISPDIF_Msk;
        }

        if (u32BusSts & HSUSBD_BUSINTSTS_DMADONEIF_Msk)
        {

            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_DMADONEIF_Msk;
#if(_USBD_USE_DMA==1)
            volatile EP_Info_t *current_ep = ptr_usbd_info->ptr_rw_info->dma_info.current_ep;

            if (current_ep)
            {
                current_ep->dma_request = false;

                if (ptr_usbd_info->ptr_rw_info->cb_endpoint_event != NULL)
                {
                    if (EP_DIR(current_ep->ep_addr))
                    {
                        if (current_ep->short_packet == true)
                        {
                            USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, current_ep->ep_addr, false);
                            ep->EPRSPCTL = (ep->EPRSPCTL & 0x10) | HSUSBD_EP_RSPCTL_SHORTTXEN;
                            current_ep->short_packet = false;
                        }
                    }
                    else
                    {
                        if ((current_ep->num_transferred_total >= current_ep->num) || (current_ep->short_packet != 0U))
                        {
                            USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, current_ep->ep_addr, false);
                            ep->EPINTEN = 0;
                            current_ep->short_packet = 0U;
#if (_USBD_USE_DMA==1 && NVT_DCACHE_ON == 1)
                            // Invalidate D-cache for DMA-received data from USB endpoint
                            SCB_InvalidateDCache_by_Addr((uint8_t *)current_ep->data, DCACHE_ALIGN_LINE_SIZE(current_ep->num_transferred_total));
#endif
                            ptr_usbd_info->ptr_rw_info->cb_endpoint_event(current_ep->ep_addr, ARM_USBD_EVENT_OUT);
                        }
                    }
                }

                ptr_usbd_info->ptr_rw_info->dma_info.current_ep = NULL;
                // If more data to transfer, start next DMA transfer
                USBD_DataStage_DMA(ptr_usbd_info);
            }

#endif
        }

        if (u32BusSts & HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk)
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk;

        if (u32BusSts & HSUSBD_BUSINTSTS_VBUSDETIF_Msk)
        {
            if (husbd->PHYCTL & HSUSBD_PHYCTL_VBUSDET_Msk)
            {
                // USB Plug In
                husbd->PHYCTL |= (HSUSBD_PHYCTL_PHYEN_Msk | HSUSBD_PHYCTL_DPPUEN_Msk);

                u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

                while (!(husbd->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
                    if (--u32TimeOutCnt == 0) break;

                husbd->OPER = HSUSBD_OPER_HISPDEN_Msk;
                husbd->OPER |= HSUSBD_OPER_HISHSEN_Msk;
                event |= ARM_USBD_EVENT_VBUS_ON;
            }
            else
            {
                // USB Unplug
                husbd->PHYCTL &= ~HSUSBD_PHYCTL_DPPUEN_Msk;
                husbd->OPER &= ~HSUSBD_OPER_HISHSEN_Msk;
                event |= ARM_USBD_EVENT_VBUS_OFF;
            }

            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_VBUSDETIF_Msk;
        }

    }

    if ((ptr_usbd_info->ptr_rw_info->cb_device_event != NULL) && (event != 0U))
    {
        ptr_usbd_info->ptr_rw_info->cb_device_event(event);
    }

    //------------------------------------------------------------------
    // Control endpoint event
    if (u32IntSts & HSUSBD_GINTSTS_CEPIF_Msk)
    {
        u32EpIntSts = husbd->CEPINTSTS & husbd->CEPINTEN;

        if (u32EpIntSts & HSUSBD_CEPINTSTS_SETUPTKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_SETUPTKIF_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_SETUPPKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_SETUPPKIF_Msk;
            USBD_SetupStage(ptr_usbd_info);
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_OUTTKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_OUTTKIF_Msk;
            husbd->CEPINTEN = HSUSBD_CEPINTEN_STSDONEIEN_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_INTKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_INTKIF_Msk;

